{
    "title" : "Blessing Understanding of Blessing",
    "body": "Although a blessing could be considered a form of prayer, there is a distinction between the two. Simply put, in prayer we direct our attention toward God. We “ask God for things,”<sup>1</sup> which may include His “blessing.” A blessing, on the other hand, comes from God and is directed toward His people. When we bless, we are invoking, summoning, or calling upon God’s blessing for the benefit of another. When we bless, we seek God’s blessing to flow through us to another.\n\n\tWe see this clearly in Numbers 6:22-27 when the LORD, through Moses, gives this instruction to Aaron and his sons: “ ‘Thus you shall bless the people of Israel: you shall say to them, The LORD bless you, and keep you; the LORD make his face to shine upon you and be gracious to you; the LORD lift up his countenance upon you and give you peace. So shall they put my name upon the people of Israel, and I will bless them.’ ” (Emphasis added.)\n\n\tNotice how many times the LORD’s name is identified with the blessing that Aaron and his sons were to bestow upon the people of Israel. It is the LORD who blesses and keeps and makes His face shine on His people. It is the LORD who directs His countenance and smile toward us, and gives His grace and peace to all.\n\n\tIn verse 27, we can see clearly that the sons of Aaron were given authority by God to call for His blessing upon an individual or group: “So shall they put my name upon the people of Israel, and I will bless them.” This is not unlike the authority Jesus gave His disciples. In John 20:23, He tells them, “If you forgive the sins of any, they are forgiven them; if you withhold forgiveness from any, it is withheld.” In Luke 9:1, He calls His 12 disciples and gives them power and authority over all the demons, as well as to heal diseases. And in Acts 3:6, Peter declares to the lame man, “I have no silver and gold, but what I do have I give to you. In the name of Jesus Christ of Nazareth, rise up and walk!”\n\n\tIt appears that blessings were a regular part of Israel’s experience at home and when they gathered as a people. As Laban was parting company with Jacob and his family, he “arose and kissed his grandchildren and his daughters and blessed them” (Genesis 31:55). Jacob, at the end of his life, gathered his children together and “blessed them, blessing each with the blessing suitable to him” (Genesis 49:28). Aaron “lifted up his hands toward the people and blessed [Israel], and he came down from offering the sin offering and the burnt offering and the peace offerings” (Leviticus 9:22). After Joshua had given the half-tribe of Manasseh its possession, he “blessed them and sent them away” (Joshua 22:6). King David brought the ark of God back to Jerusalem and “blessed the people in the name of the LORD of hosts” and then “returned to bless his household” (2 Samuel 6:18-20).\n\n\tTwice in the Gospels, Jesus blesses people. In Mark 10, we are told that He took the children into His arms “and blessed them, laying his hands on them” (Mark 10:15). And just before ascending to heaven, Luke tells us that Jesus led His disciples “out as far as Bethany, and lifting up his hands he blessed them. While he blessed them, he parted from them and was carried up into heaven. And they worshiped Him and returned to Jerusalem with great joy” (Luke 24:50-52).\n\n\tOne of the more notable blessings in the Bible was the blessing Isaac intended for Esau, but gave instead to Jacob when Jacob deceived him. This blessing had prophetic qualities that are unique. This blessing was not something the sons of Isaac had received before. It came when Isaac knew his days on earth were ending (Genesis 27:2-4), and when he was ready to pass on the authority and the covenant blessing that had been handed down to him by his father Abraham. Once pronounced, it was irrevocable. Even when Isaac realized he had been tricked, it was impossible for him to remove the blessing from Jacob (Genesis 27:33-40).\n\n\tWe see the prophetic blessing again at the end of Jacob’s life when Joseph’s sons are blessed. Joseph’s unsuccessful attempt to move Jacob’s right hand of blessing from Ephraim to Manasseh points to the prophetic significance. Not only are the words of blessing important, but so is the placement of the hand (Genesis 48:9-20).\n\n\tSuch prophetic blessings were extraordinary and mainly associated with God’s covenant purposes as they were revealed from one generation to the next. The kind of blessing that we do in the context of home and family does not carry this same prophetic weight. When I place my hand on my daughter’s head and say “May you be blessed as a woman who fears the LORD, a woman who finds great delight in the LORD’s commands,” I am seeking God’s favor upon her in the hope that she will be a woman who fears the LORD, but I am not declaring in a prophetic sense that she will become such a woman.",
    "footers": [
        {
            "title": "1",
            "content": "For further discussion of this understanding of prayer, see John Piper’s sermon on Colossians 4:2-4, “Devote Yourselves to Prayer,” January 9, 2000, available at desiringGod.org."
        }
    ] 
}