{
    "title" : "The Fruits of a Blessing",
    "body": "In the years that I have been using blessings in my role as a father, grandfather, and pastor, I have discovered, through my own experience and the experience of others, that alongside the joy of being an instrument of blessing in another’s life, there are many fruits to enjoy from this practice. Here is a “taste” of what has come:\n\n1. The opportunity to acknowledge God as the source of every blessing.\n\tBased on the biblical understanding of blessing, the most obvious benefit is that it is a means of God blessing His people. Even though there is a difference between a prayer and a blessing, God’s response to a blessing is similar to His response to our prayers. The LORD delights in magnifying His name by fulfilling the desires of those who fear Him (Psalm 145:19).\n\n\tHe is not obligated to act according to the blessings we invoke any more than He is obligated to give us what we ask for in prayer. Nevertheless, we bless in the same confidence that we pray, knowing that God is faithful to His Word and delights to act in response to the faith of His people.\n\n2. Blessings touch the future.\n\tBlessings have a forward view. This is obvious in the prophetic blessings of the patriarchs, but it is also true of ordinary blessings. The fact that many blessings were given at moments of parting or separation points to the future orientation of the blessing. When we say to someone, “The LORD bless you and keep you,” we are not only seeking God’s blessing for the moment, but desire God’s blessing to continue as they go. We commend them to the “LORD, who made heaven and earth” with confidence that He will be their “keeper” and not let their “foot be moved,” and that He will keep their “going out” and their “coming in from this time forth and forevermore” (Psalm 121).\n\n\tAs years were added to my daughters’ lives, there were fewer and fewer opportunities to personally watch over them. Hours of physical separation from them have become months. One day I will be completely removed from their lives. As they were growing up, I was keenly aware of how quickly time was passing, and with it my fleeting influence upon them. For me, the blessing was an opportunity to touch their lives for the present, and for the inevitable day when time and miles, and death will separate us.\n\n\tAs I face these separations, I am encouraged by the biblical image of the Lord storing up the prayers of His people and responding to them on His timetable. One place I see this is in Acts 10:4, when the Lord spoke to Cornelius and said, “Your prayers and your alms have ascended as a memorial before God.” At the right moment, God answered those prayers and granted this Gentile the repentance that leads to life.\n\n\tAnother place I see this is in Exodus 3:9 when the LORD spoke to Moses and said, “the cry of the people of Israel has come to me, and I have also seen the oppression with which the Egyptians oppress them.” These cries had been ascending to the LORD for more than 400 years. When the time was right, He poured out the fruit of those prayers. As I bless my children in the presence of God, I am conscious that God hears and remembers the blessing. He remembers today’s blessing on my children, and He will remember it 45 years from now, when the time is right, and pour out His favor on my octogenarian daughters in response to their daddy’s blessing decades before.\n\n\tI will take this idea one step further and say that even beyond the lives of my children I expect there to be fruit from these blessings. So many of the blessings that I give my children reflect my desire that the fruit of God’s work through me will continue to every generation coming after me until Jesus returns. Some of these blessings include: “May He watch over your coming and going, both now and forever” (Psalm 121:8); “May your name be remembered forever” (Psalm 112:6); “May you dwell in the house of the LORD forever” (Psalm 23:6); “Even to the next generation may you and your children be blessed” (adapted from Psalm 112:2); and “May the LORD give you pleasure at His right hand, forever” (adapted from Psalm 16:11).\n\n\tSince I first began blessing my daughters, I have had a vision of a night, 150 years from now. I imagine a young man kneeling beside his child’s bed, pronouncing the same blessing that his Great Great Great Grandfather Michael pronounced over his great great grandmother. This is more than a sentimental desire. It is rooted in an earnest prayer that a river of faith will flow through my descendants, and that all of them will fear the LORD (Psalm 103:17).\n\n3. The blessing gives my children a vision for what I desire most for them.\n\tThe blessing is not only given in the presence of God, but also in the presence of the ones being blessed. As parents, we care that our children have a good education, good health, a good spouse, and a good job. We expend a great deal of energy and resources toward these ends. As important as these things are, they fade when compared to those things that have eternal value. The blessing is a way for my children to hear and understand what their daddy desires most for them. Night after night, they hear me express my desire that they fear the LORD and delight to do His will. They hear the hope that the LORD will be their counselor all the days of their lives, and that they will always set the LORD before them. They catch a vision for being like Mount Zion, which cannot be shaken but endures forever (Psalm 125:1), and for having their names be remembered by the LORD forever (Psalm 112:6).\n\n4. The blessing can be a means of comfort and reassurance.\n\tThe blessing is a reminder of the presence of God and His care for us: “Even while you sleep, may the LORD instruct your heart” (adapted from Psalm 16:7), “May the LORD watch over you and be a shade at your right hand so the sun will not harm you by day nor the moon by night” (adapted from Psalm 121:5-6), and “May the LORD answer you when you pray and relieve you in distress” (adapted from Psalm 4:1).\n\n\tI have heard several testimonies from parents whose children had different problems related to fear at night. In many of these cases, there was a remarkable change after the parent began blessing the child at bedtime. As a pastor, I regularly bless people I visit in the hospital because I have found that speaking God’s Word over a person in this way can bring the LORD’s peace to anxious souls awaiting surgery or struggling with a critical illness or disease. For those who grieve, the blessing brings hope and comfort as we call upon the God of hope to fill them with all joy and peace, as they trust in Him that they may abound in hope through the power of the Holy Spirit (Romans 15:13).\n\n5. The blessing can help heal strained relationships.\n\tThe blessing can give children assurance of parental love after a hard day. It is not uncommon for there to be days when a parent and child become irritated or angry with each other and perhaps say or do things that are hurtful. There are also days when a child disobeys and is punished by the same hand that blesses. At the end of such a day, it can be a great encouragement for that child to hear words of blessing directed toward him. It provides a way for the parent to say, “In spite of what has happened between us today, I still love you, and the desire of my heart is for your good.”\n\n\tThe blessing can have this effect on adults as well. It is disarming when a blessing is pronounced on someone in a relationship that is strained. It is very difficult to stay angry with a person who is sincerely blessing you. The defenses will often drop while the doors of forgiveness and reconciliation open.\n\n6. The blessing can help strengthen the bonds of affection between children and parents. \n\tIn what seemed like a blink of the eye, Sally and I were “empty-nesters” walking past two empty bedrooms at night. The joy of tucking my girls into bed with a prayer and a blessing is now only a precious memory. As adults, I hope my daughters can forget my shortcomings and the mistakes I made along the way with my careless words and foolish actions. As they look back over the years when they were young, I pray they will never forget the heart of a daddy who desired more than anything that they be filled with God and enjoy Him forever. \n\n\tI believe the blessings have helped my daughters to see this desire in me. God has used the blessings to knit our hearts together with a deep affection and love, which I trust will endure for a lifetime. By itself, the blessing cannot take the place of faithful parenting. We ought not be deceived into thinking that we can bless our children once a day while ignoring them and their needs the rest of the time. However, combined with faithful parenting, the blessing can be a powerful tool in strengthening the bonds of affection and establishing our children firmly in faith. \n\n7. The practice of blessing encourages men in their roles as spiritual leaders. \n\tIn the previous chapter, “Responsibility and Authority to Bless,” I encouraged husbands and fathers to initiate the practice of blessing in their homes and gave reasons why I believe the church and the home would both benefit. Little more needs to be said here except to emphasize that when a man is regularly blessing his wife and children, he is more likely to give spiritual leadership in other areas of personal and family life.",
    "footers" : []
}