{
    "title" : "Beginning a Pattern of Blessing",
    "body" : "In the spring of 1991, our daughters were settling into bed after a delightful evening of “family week” activities at our church. We had just watched the film, The Blessing,<sup>1</sup> featuring Gary Smalley and John Trent. The film had left me with overwhelming feelings of inadequacy as I pondered my calling, my responsibility, and my deep longing as a father to be a blessing to my children. The weight seemed heavy as our bedtime prayers came to a close. \n\n\tAs a pastor, I was accustomed to pronouncing “benedictions,” but not until that moment had I considered pronouncing a benediction or “blessing” over my children. Not until that moment had these girls felt their daddy’s right hand on their heads while he called upon the God of Abraham, Isaac, and Jacob to bless them. Not until that moment had I felt such assurance from my Heavenly Father that He would be for my daughters a blessing of infinite value beyond all that I could hope to be. Not until that moment had I, with such earnest and desperate desire, looked into the eyes of each daughter and said,\n\n\tMay the LORD bless you and keep you! \n\n\tMay the LORD make His face shine upon you and be gracious to you! \n\n\tMay the LORD lift up His countenance upon you and give you peace! \n\n\tThat night “the blessing” was added to the bedtime routine. As our daughters made their way toward womanhood, our routine changed. The after-supper wrestling matches, bedtime stories on my lap, and airplane rides into bed became either impossible or no longer “cool,” but for both daddy and daughters the daily bedtime blessing continued to be cherished (and “cool”) as long as they were living at home. \n\n\tMany bedtimes have come and gone since that first night of blessing in the spring of 1991. Today, the two little girls are women, and the bedtime routine we once knew is now a precious memory. Along the way, there have been poignant moments of blessing that even now, as I call them to mind, bring a lump to my throat and tears to my eyes. Moments in dorm rooms and airports where we embraced and prayed one last prayer and one last blessing before the miles separated us. Moments at graduations, baptisms, and other significant events when I would look into the eyes of my grown-up “little girls.” With my hand on their shoulders and familiar words of blessing on their heads, my heart overflowed again and again with familiar longings that the Father of infinite blessing would satisfy them beyond all that their earthly father could hope for.\n\n\tToday I can look into the eyes of two more little girls and one little boy (our grandchildren), and what I see is not only the eyes of their mother; I see the eyes of the next generation. The longing in this grandpa’s heart is the same as the longing in the heart of this father for more than three decades—the longing that “One generation shall commend [God’s] works to another, and shall declare [God’s] mighty acts” (Psalm 145:4).",
    "footers" : [
        {
            "title": "1",
            "content": "The Blessing, a 60-minute videocassette produced by Jeff Bowden. (Nashville, Tenn.: Thomas Nelson, 1991)."
        }
    ]
}